//   1. перебрати його циклом while

// Виконання
// let nums = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// let i = 0;
// while (i < nums.length) {
//     console.log(nums[i]);
//     i++;
// }

//----------------------------------------------------
//   2. перебрати його циклом for

//Виконання
// let nums = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// for (const num of nums) {
//     console.log(num);
// }

//----------------------------------------------------

//   3. перебрати циклом while та вивести  числа тільки з непарним індексом

//Виконання
// let nums = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// let i = 0;
//
// while (i < nums.length) {
//     if (i % 2 !==0) {
//         console.log(nums[i]);
//     }
//     i++;
// }

//----------------------------------------------------

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом


// Виконання
// let nums = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
//
// for (let i = 0; i < nums.length; i++) {
//     if (i % 2 !== 0) {
//         console.log(nums[i]);
//     }
// }


//-----------------------------------------------------
// 5. перебрати циклом while та вивести  числа тільки парні  значення

// Виконання
// let nums = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// let i = 0;
// while (i < nums.length) {
//     if (nums[i] % 2 === 0) {
//         console.log(nums[i])
//     }
//     i++;
// }
//

//------------------------------------------------------


// 6. перебрати циклом for та вивести  числа тільки парні  значення

//Виконання
// let nums = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// for (const num of nums) {
//     if (num % 2 === 0) {
//         console.log(num);
//     }
// }

//------------------------------------------------------

// 7. замінити кожне число кратне 3 на слово "okten"


// Виконання
// let nums = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// let numsMapped = nums.map(value => {
//     if (value % 3 === 0) {
//         return value = 'okten'
//     }else {
//         return value;
//     }
// });
//
// console.log(numsMapped);
//

//------------------------------------------------------


// 8. вивести масив в зворотньому порядку.

//Виконання
// let nums = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// for (let i = nums.length - 1; i >= 0; i--) {
//     console.log(nums[i]);
// }
//
// console.log(nums.reverse());


//------------------------------------------------------


// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

//9.1

// Виконання
// let nums = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// let i = 10;
// while (i > 0) {
//     console.log(nums[i]);
//     i--;
// }


//----------------------------------

//9.2

// Виконання
// let nums = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// for (let i = 10; i > 0; i--) {
//     console.log(nums[i]);
// }

//-----------------------------------

//9.3

// Виконання
// let nums = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// let i = 10;
//
// while (i > 0) {
//     if (i % 2 !==0) {
//         console.log(nums[i]);
//     }
//     i--;
// }

//-----------------------------------

//9.4

//Виконання
// let nums = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
//
// for (let i = 10; i > 0; i--) {
//     if (i % 2 !== 0) {
//         console.log(nums[i]);
//     }
// }


//-----------------------------------

//9.5

// Виконання
// let nums = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// let i = 10;
// while (i > 0) {
//     if (nums[i] % 2 === 0) {
//         console.log(nums[i])
//     }
//     i--;
// }

//------------------------------------

//9.6

//Виконання
// let nums = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// for (i = 10; i > 0; i--) {
//     if (nums[i] % 2 === 0) {
//         console.log(nums[i]);
//     }
// }

//-------------------------------------


//9.7

// Виконання
// let nums = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
//
// for (let i = 9; i > 0; i--) {
//     if (nums[i] % 3 === 0) {
//         nums[i] = 'okten';
//     }
//     console.log(nums[i]);
//
// }

//-------------------------------------