// --створити масив з:
//   - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль


// Виконання
// let numArr = [5, 15, 666, 123, 345];
// let strArr = ['hello', 'okten', 'owu', 'asd', 'abc'];
// let arr = [].concat(numArr + ',' + strArr)
//
// console.log(arr);


//------------------------------------------------------------------

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

// Виконання
// let emptyArr = [];
//
// emptyArr[0] = 'hello'
// emptyArr[1] = 'okten'
// emptyArr[2] = 666;
//
// console.log(emptyArr);

//------------------------------------------------------------------

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині

// Виконання
// for (let i = 0; i < 10; i++) {
//     document.write('<div>hello</div>')
// }

//------------------------------------------------------------------

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині

// Виконання
// for (let i = 0; i < 10; i++) {
//     document.write(`<div>Hello Okten ${i+1}</div>`)
// }


//------------------------------------------------------------------

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.


// Виконання
// let i = 0;
// while (i <= 20) {
//     document.write('<h1>Okten Web</h1>');
//     i++;
// }

//------------------------------------------------------------------

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.

// Виконання
// let i = 0;
// while (i < 20) {
//     document.write(`<h1>Hello ${i+1} Okten </h1>`)
//     i++;
// }

//------------------------------------------------------------------

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.


//Виконання
// let nums = [3, 5, 2, 33, 10, 15, 234, 284, 290, 11];
//
// for (const num of nums) {
//     console.log(num);
// }

//------------------------------------------------------------------

// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.

// Виконання
// let stringsArr = ['asd', 'qwe', 'asdqwe', 'aaa', 'hello', 'okten', 'dasfas', 'owu', 'op', 'js'];
//
// for (const string of stringsArr) {
//     console.log(string);
// }
//

//------------------------------------------------------------------

// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.

// Виконання
// let arr = ['asd', 123, true, 'hello', [123, 123], 'majahet', 666, false, {name: 'Vasya'}]
//
// for (const arrElement of arr) {
//     console.log(arrElement);
// }

//------------------------------------------------------------------

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи

//Виконання
// let arr = ['asd', 123, true, 'hello', [123, 123], 'majahet', 666, false, {name: 'Vasya'}]
// for (const arrElement of arr) {
//     if (typeof arrElement === 'boolean') {
//         console.log(arrElement);
//     }
//
// }


//------------------------------------------------------------------

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи

// Виконання
// let arr = ['asd', 123, true, 'hello', [123, 123], 'majahet', 666, false, {name: 'Vasya'}]
//
// for (const arrElement of arr) {
//     if (typeof arrElement === 'number') {
//         console.log(arrElement);
//     }
// }

//------------------------------------------------------------------

// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи

//Виконання
// let arr = ['asd', 123, true, 'hello', [123, 123], 'majahet', 666, false, {name: 'Vasya'}]
//
// for (const arrElement of arr) {
//     if (typeof arrElement === 'string') {
//         console.log(arrElement);
//     }
// }

//------------------------------------------------------------------

// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.

// Виконання
// let arr = [];
//
// arr[0] = 'hello';
// arr[1] = 666;
// arr[2] = 333;
// arr[4] = 'owu';
// arr[5] = 'Max';
// arr[6] = true;
// arr[7] = false;
// arr[8] = [3, 5, 2, 'hi'];
// arr[9] = {name: 'Max', age: 20}
//
// for (const arrElement of arr) {
//     console.log(arrElement);
// }

//------------------------------------------------------------------

// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

// Виконання
// for (let i = 0; i < 10; i++) {
//     document.write(`<div>Step ${i+1}</div>`)
// }
//
// for (let i = 0; i < 10; i++) {
//     console.log(`step ${i+1}`)
// }

//------------------------------------------------------------------

// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

// Виконання
// for (let i = 0; i < 100; i++) {
//     document.write(`<div>Step ${i+1}</div>`)
// }
//
// for (let i = 0; i < 100; i++) {
//     console.log(`Step ${i+1}`)
// }

//------------------------------------------------------------------

// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write

// Виконання
// for (let i = 2; i <= 100; i+=2) {
//     document.write(`<div>Step ${i}</div>`)
// }
//
// for (let i = 2; i <= 100; i+=2) {
//     console.log(`Step ${i}`)
// }

//------------------------------------------------------------------

// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write


// Виконання
// for (let i = 0; i <= 100; i++) {
//     if (i % 2 === 0) {
//         console.log(`Step ${i}`)
//     }
//
// }
//
// for (let i = 0; i <= 100; i++) {
//     if (i % 2 === 0) {
//         document.write(`<div>Step ${i}</div>`)
//     }
//
// }

//------------------------------------------------------------------

// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write


// Виконання
// for (let i = 0; i < 100; i++) {
//     if (i % 2 !== 0) {
//         console.log(`Step ${i}`)
//     }
// }
//
// for (let i = 0; i < 100; i++) {
//     if (i % 2 !== 0) {
//     document.write(`<div>Step ${i}</div>`)
//     }
// }

//------------------------------------------------------------------